<!-- Инструкции if могут быть бесконечно вложены в другие инструкции if, что даёт большую гибкость в организации условного выполнения различных частей программы.-->
<!DOCTYPE html> 
<html>
 <head>
   <title>Корзина кол-во c 10 по 51</title>
  <meta charset="utf-8">
  </head>
 <body>
<?php
if ($kol >= 10 && $kol < 21) {  // кол-во товаров с 10 до 20
    echo "товаров";
    } elseif ($kol == 21) {  // 21 товар
    echo "товар";
    }
    if ($kol >= 22 && $kol < 25) {  // 22 - 24 товара
    echo "товара";
    } elseif ($kol >= 25 && $kol < 30){  // 25 - 30 товаров
    echo "товаров";
    } elseif ($kol == 31) {  // 31 товар
    echo "товар";
    }
    if ($kol >= 32 && $kol < 35) {  // 32 - 34 товара
    echo "товара";
    } elseif ($kol >= 35 && $kol < 40){  // 35 - 40 товаров
    echo "товаров";
    } elseif ($kol == 41) {  // 41 товар
    echo "товар";
    }
    if ($kol >= 42 && $kol < 45) {  // 42 - 44 товара
    echo "товара";
    } elseif ($kol >= 45 && $kol < 50){  // 45 - 50 товаров
    echo "товаров";
    } elseif ($kol == 51) {  // 51 товар
    echo "товар";
    }    
?>  
  </body> 
</html>

