<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
<title>Цикл FOREACH</title>
</head>

<body>
<?php
// есть список чего-либо и он находится в массиве, нужно обработать массив и построчно вывести данные в окно браузера
// задаем имя_массива и две переменные: [$key] (индекс или ассоциативное_имя значение) => значение ячейки массива, далее действия
// цикл foreach выполняет это для всех ячеек массива, пока не пройдет их все, либо остановить с помощью breake
/*причем при индексном массиве, можно не использовать [$key] (индекс) так как нас чаще интересуют именно значения, а следовательно [ключ] (индекс) можно опустить, тогда будут считываться значения из ячеек массива и записываться в переменную, например $value, которую мы указали в цикле foreach:
foreach ($array as [$key=>] $value) {
действие (например вывод на экран echo	
}*/








?>
</body>
</html>